{"news":{"blog_url":"media.pitechplus.com","title":"A Few Words With Bogdan Herea, CEO of PitechPlus","promote":"1","category":{"target_id":"3"},"description":"\u003Cp\u003EAs you all know, there will be plenty of speakers attending this year’s edition of\u0026nbsp;\u003Cstrong\u003ETechsylvania\u003C\/strong\u003E, among them being the CEO of\u0026nbsp;\u003Cstrong\u003EPITECH+PLUS\u003C\/strong\u003E, a group of reliable companies specialised in outsourcing and consultancy for the IT industry. What began as a simple startup with 10 people and only one location in Cluj-Napoca soon grew to around 250 employees and offices based in Targu Mures, Bucharest, Brussels, Berlin and Paris.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EThe\u0026nbsp;group portfolio is split into 3 work divisions: Digital, Engineering and Startup, with the latter focusing on helping more than 20 tech-based startups make, evolve and develop quality products. As of 2014,\u0026nbsp;\u003Cstrong\u003EPITECH+PLUS\u0026nbsp;has also launched the\u0026nbsp;ACADEMY+PLUS school,\u0026nbsp;\u003C\/strong\u003Ein collaboration with\u0026nbsp;School 42\u003Cstrong\u003E.\u0026nbsp;\u003C\/strong\u003EACADEMY+PLUS is\u0026nbsp;revolutionising the education field by helping talented programmers hone their skills in order to achieve success career-wise.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n\r\n\u003Ch2\u003EThe PITECH+PLUS interview you’ve all been waiting for\u003C\/h2\u003E\r\n\r\n\u003Cp\u003ESince PITECH+PLUS is\u0026nbsp;one of our Bronze Partners, thus helping make this year’s edition of Techsylvania a reality, we decided to share our interview with their CEO, Bogdan Herea, with all of you:\u003C\/p\u003E\r\n\r\n\u003Ch3\u003E1.\u0026nbsp;Where is your focus these days: on PITECH+PLUS or on ACADEMY+PLUS?\u003C\/h3\u003E\r\n\r\n\u003Cp\u003EOur purpose is to create a framework where bright people can join us to create successful products. Therefore, instead of mentioning priorities, I prefer to use the term “complementary”. We cannot reach our goals as a company without taking into consideration the “good” that ACADEMY+PLUS is bringing to our current business.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EAlbeit the vocational school launched in partnership with School 42 is free of charge for students, we reckon this project has an inside value that is far more important for our community.\u003C\/p\u003E\r\n\r\n\u003Ch3\u003E2.\u0026nbsp;You have started developing some internal products. Can you tell us something more?\u003C\/h3\u003E\r\n\r\n\u003Cp\u003EAlthough PITECH+PLUS has been delivering high quality services since 2005, two startups developed internally, as part of the group, are to be launched in the last quarter of 2015.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EPARKING+PLUS is a parking solution developed in partnership with Cluj IT Cluster. The purpose of this app is to help drivers find available parking spaces while saving time for more important activities.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EThe other one is an invoice remittance solution that connects utility providers with banks and clients. The goal of Youssef Hautier, general manager of SONIC+PLUS and a former student of HEC University of Lausanne, is to deliver a platform that will enable its users to save time when paying their invoices while keeping total control of their spending.\u003C\/p\u003E\r\n\r\n\u003Ch3\u003E3. You are quite active in the startup ecosystem lately. How did you become so involved in this area?\u003C\/h3\u003E\r\n\r\n\u003Cp\u003EThere is a set of factors that made us move to this direction. Firstly, it is important to mention that PITECH+PLUS has a division dealing with more than 25 startup companies that have technology at the core of their business model. Consequently, a lot of know-how was transferred to our teams.\u003C\/p\u003E\r\n\r\n\u003Cp\u003EThe second factor is linked to the industry itself. Romania is known for its outsourcing services in the IT sector. \u0026nbsp;Nevertheless we must ask ourselves how sustainable the outsourcing model is on the long term. Is it wise o put all the eggs in one basket?\u003C\/p\u003E\r\n\r\n\u003Cp\u003ETo sum-up these ideas, we’ve decided to get involved in this ecosystem of ideas and tech creativity because we understood that for us it’s time to do so. We have the know-how and we have also the passionate apprentices. Not all of them are in Silicon Valley, Romania has a lot of potential.\u003C\/p\u003E\r\n\r\n\u003Cp\u003E\u0026nbsp;\u003C\/p\u003E\r\n\r\n\u003Cp\u003ESource:\u0026nbsp;\u003C\/p\u003E\r\n\r\n\u003Cp dir=\u0022ltr\u0022\u003E\u003Cstrong\u003E\u003Ca href=\u0022http:\/\/blog.techsylvania.co\/2015\/06\/30\/having-a-few-words-with-bogdan-herea-the-ceo-of-pitech-plus\/\u0022\u003Ehttp:\/\/blog.techsylvania.co\/2015\/06\/30\/having-a-few-words-with-bogdan-herea-the-ceo-of-pitech-plus\/\u003C\/a\u003E \u003C\/strong\u003E\u003C\/p\u003E\r\n","short_description":"What began as a simple startup with 10 people and only one location in Cluj-Napoca soon grew to around 250 employees and offices based in Targu Mures, Bucharest, Brussels, Berlin and Paris.","preview_image":"https:\/\/pitechbo.pitechplus.com\/sites\/default\/files\/2017-10\/bogdan-herea3.jpg","path":"a-few-words-with-bogdan-herea-ceo-of-pitechplus","internal_path":"\/articles\/a-few-words-with-bogdan-herea-ceo-of-pitechplus","categories":{"blog":{"target_id":"1","name":"Blog","icon":"https:\/\/pitechbo.pitechplus.com\/sites\/default\/files\/2017-09\/2_blog-40x40.png","active_icon":"https:\/\/pitechbo.pitechplus.com\/sites\/default\/files\/2017-09\/2_blog-active-40x40.png","path":"blog"},"events":{"target_id":"2","name":"Events","icon":"https:\/\/pitechbo.pitechplus.com\/sites\/default\/files\/2017-09\/1_events-40x40.png","active_icon":"https:\/\/pitechbo.pitechplus.com\/sites\/default\/files\/2017-09\/1_events-active-40x40.png","path":"events"},"press":{"target_id":"3","name":"Press","icon":"https:\/\/pitechbo.pitechplus.com\/sites\/default\/files\/2017-09\/3_press-40x40.png","active_icon":"https:\/\/pitechbo.pitechplus.com\/sites\/default\/files\/2017-09\/3_press-active-40x40.png","path":"press"},"testimonials":{"target_id":"4","name":"Testimonials","icon":"https:\/\/pitechbo.pitechplus.com\/sites\/default\/files\/2017-09\/4_testimonials-40x40.png","active_icon":"https:\/\/pitechbo.pitechplus.com\/sites\/default\/files\/2017-09\/4_testimonials-active--40x40.png","path":"testimonials"}}}}